1. How would you handle missing values in a Pandas DataFrame? Write code to fill missing values with the mean for numeric columns and the mode for categorical columns.

In [9]:
import pandas as pd
import numpy as np

data= {
    'A':[1,np.nan,3,np.nan,5],
    'B':[6,7,8,9,10],
    'C':['a','b',np.nan,np.nan,np.nan]
}
df1 = pd.DataFrame(data)
print(data)

{'A': [1, nan, 3, nan, 5], 'B': [6, 7, 8, 9, 10], 'C': ['a', 'b', nan, nan, nan]}

In [10]:
df1

     A   B    C
0  1.0   6    a
1  NaN   7    b
2  3.0   8  NaN
3  NaN   9  NaN
4  5.0  10  NaN

In [11]:
df1.fillna('')

     A   B  C
0  1.0   6  a
1        7  b
2  3.0   8
3        9
4  5.0  10

In [17]:
print(df1.dtypes)

A    float64
B      int64
C     object
dtype: object

In [18]:
num_cols = df1.select_dtypes(include='number')

In [20]:
num_cols

     A   B
0  1.0   6
1  NaN   7
2  3.0   8
3  NaN   9
4  5.0  10

In [21]:
#to extract only column names
num_cols = df1.select_dtypes(include='number').columns

In [22]:
num_cols

Index(['A', 'B'], dtype='object')

In [ ]:
# Fill missing values in numeric columns with the mean

In [25]:
df1[num_cols]=df1[num_cols].fillna(df1[num_cols].mean())

In [26]:
df1

     A   B    C
0  1.0   6    a
1  3.0   7    b
2  3.0   8  NaN
3  3.0   9  NaN
4  5.0  10  NaN

In [27]:
# Fill missing values in categorical columns with the mode
categorical_cols= df1.select_dtypes(include='object')

In [28]:
categorical_cols

     C
0    a
1    b
2  NaN
3  NaN
4  NaN

In [29]:
categorical_cols= df1.select_dtypes(include='object').columns

In [30]:
categorical_cols

Index(['C'], dtype='object')

In [33]:
df1[categorical_cols] = df1[categorical_cols].fillna( df1[categorical_cols].mode().iloc[0])

In [34]:
df1

     A   B  C
0  1.0   6  a
1  3.0   7  b
2  3.0   8  a
3  3.0   9  a
4  5.0  10  a

2. How would you remove duplicate rows from a DataFrame?

Answer:
To remove duplicate rows from a Pandas DataFrame, we can use the drop_duplicates() method. This method removes rows that have the same values in all columns or in a subset of specified columns.

In [35]:
import pandas as pd

# Sample DataFrame with duplicate rows
data = {
    'A': [1, 2, 2, 3, 4],
    'B': [5, 6, 6, 7, 8],
    'C': ['x', 'y', 'y', 'z', 'w']
}
df = pd.DataFrame(data)

In [36]:
df

   A  B  C
0  1  5  x
1  2  6  y
2  2  6  y
3  3  7  z
4  4  8  w

In [37]:
df.drop_duplicates()

   A  B  C
0  1  5  x
1  2  6  y
3  3  7  z
4  4  8  w

3. Removing Duplicates Based on Specific Columns

If you want to remove duplicates based on a subset of columns, you can use the subset parameter:

In [39]:
df

   A  B  C
0  1  5  x
1  2  6  y
2  2  6  y
3  3  7  z
4  4  8  w

In [40]:
df.drop_duplicates(subset=['A','C'])

   A  B  C
0  1  5  x
1  2  6  y
3  3  7  z
4  4  8  w

4. Keeping the First or Last Occurrence - while deleting duplicates

By default, drop_duplicates() keeps the first occurrence of a duplicate row. To keep the last occurrence, use the keep parameter:

In [41]:
df

   A  B  C
0  1  5  x
1  2  6  y
2  2  6  y
3  3  7  z
4  4  8  w

In [42]:
df.drop_duplicates(keep='last')

   A  B  C
0  1  5  x
2  2  6  y
3  3  7  z
4  4  8  w